name: "CaffeNet"
layer {
name: "data"
          type: "Data"
          top: "data"
          top: "label"
          include {
phase: TRAIN
          }   
      data_param {
source: "newfile/img_train_lmdb"
            backend:LMDB
            batch_size: 128 
      }   

      transform_param {
mean_file: "newfile/train_mean.binaryproto"
               mirror: true
      }   
}

layer {
name: "data"
          type: "Data"
          top: "data"
          top: "label"
          include {
phase: TEST
          }   
      transform_param {
mirror: false
            crop_size: 227 
            mean_file: "newfile/test_mean.binaryproto"
      }   
      data_param {
source: "newfile/img_test_lmdb"
            batch_size: 50
            backend: LMDB
      }   
}
